# AssemblyDidNotMatchRequestedTypeWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..AssemblyDidNotMatchRequestedTypeWarn Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Assembly was changed to a new type, but did not match the type. Geometry could have been changed due to a join condition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AssemblyDidNotMatchRequestedTypeWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyDidNotMatchRequestedTypeWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AssemblyDidNotMatchRequestedTypeWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace